Examinator/src/Enums/ПродолжительностьОбученияСУО/ПродолжительностьОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПродолжительностьОбученияСУО</name>
  <enumValues>
    <name>Фиксированная</name>
  </enumValues>
  <enumValues>
    <name>СНачалаОбучения</name>
  </enumValues>
  <enumValues>
    <name>СЗачисления</name>
  </enumValues>
  <enumValues>
    <name>НеЗадана</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ПродолжительностьОбученияСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ЗначениеВЧисло(Значение) Экспорт
	
	Если Значение = Перечисления.ПродолжительностьОбученияСУО.НеЗадана Тогда
		Возврат 1;
	КонецЕсли;
	
	Если Значение = Перечисления.ПродолжительностьОбученияСУО.Фиксированная Тогда
		Возврат 2;
	КонецЕсли;
	
	Если Значение = Перечисления.ПродолжительностьОбученияСУО.СНачалаОбучения Тогда
		Возврат 3;
	КонецЕсли;
	
	Если Значение = Перечисления.ПродолжительностьОбученияСУО.СЗачисления Тогда
		Возврат 4;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ЧислоВЗначение(ЗначениеЧисло) Экспорт
	
	Если ЗначениеЧисло = 1 Тогда
		Возврат Перечисления.ПродолжительностьОбученияСУО.НеЗадана;
	КонецЕсли;
	
	Если ЗначениеЧисло = 2 Тогда
		Возврат Перечисления.ПродолжительностьОбученияСУО.Фиксированная;
	КонецЕсли;
	
	Если ЗначениеЧисло = 3 Тогда
		Возврат Перечисления.ПродолжительностьОбученияСУО.СНачалаОбучения;
	КонецЕсли;
	
	Если ЗначениеЧисло = 4 Тогда
		Возврат Перечисления.ПродолжительностьОбученияСУО.СЗачисления;
	КонецЕсли;
	
	Возврат Перечисления.ПродолжительностьОбученияСУО.ПустаяСсылка();	
	
КонецФункции

#КонецЕсли
